<a href="https://colab.research.google.com/github/pttrilok/courses/blob/master/AI%20Foundation/Lesson%205%20(AI%20Foundation).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction to Pandas

In this section of the course we will learn how to use pandas for data analysis. You can think of pandas as an extremely powerful version of Excel, with a lot more features. In this section of the course, you should go through the notebooks in this order:

* Introduction to Pandas
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging,Joining,and Concatenating
* Operations
* Data Input and Output


# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

In [ ]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [ ]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

**Using Lists**

In [ ]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

**NumPy Arrays**

In [ ]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

**Dictionary**

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Data in a Series

A pandas Series can hold a variety of object types:

In [ ]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [ ]:
# Even functions (although unlikely that you will use this)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [ ]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [ ]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [ ]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
ser1['USA']

1

Operations are then also done based off of index:

In [ ]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [ ]:
from numpy.random import randn

In [ ]:
np.random.seed(11)
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [ ]:
df['W']

A    1.749455
B   -0.008285
C    0.421051
D    0.689682
E    0.736837
Name: W, dtype: float64

In [ ]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  1.749455 -2.653319
B -0.008285  0.315403
C  0.421051 -0.475733
D  0.689682 -1.119475
E  0.736837 -0.683447

In [ ]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    1.749455
B   -0.008285
C    0.421051
D    0.689682
E    0.736837
Name: W, dtype: float64

DataFrame Columns are just Series

In [ ]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [ ]:
df['new'] = df['W'] + df['Y']

In [ ]:
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.264890
B -0.008285 -0.319631 -0.536629  0.315403 -0.544914
C  0.421051 -1.065603 -0.886240 -0.475733 -0.465189
D  0.689682  0.561192 -1.305549 -1.119475 -0.615866
E  0.736837  1.574634 -0.031075 -0.683447  0.705762

**Removing Columns**

In [ ]:
df.drop('new',axis=1)

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

In [ ]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  1.749455 -0.286073 -0.484565 -2.653319  1.264890
B -0.008285 -0.319631 -0.536629  0.315403 -0.544914
C  0.421051 -1.065603 -0.886240 -0.475733 -0.465189
D  0.689682  0.561192 -1.305549 -1.119475 -0.615866
E  0.736837  1.574634 -0.031075 -0.683447  0.705762

In [ ]:
df.drop('new',axis=1,inplace=True)

In [ ]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

Can also drop rows this way:

In [ ]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475

**Selecting Rows**

In [ ]:
df.loc['A']

W    1.749455
X   -0.286073
Y   -0.484565
Z   -2.653319
Name: A, dtype: float64

In [ ]:
df.loc[:,'W']

A    1.749455
B   -0.008285
C    0.421051
D    0.689682
E    0.736837
Name: W, dtype: float64

Or select based off of position instead of label

Selecting rows by passing index of particular row

In [ ]:
df.iloc[2]

W    0.421051
X   -1.065603
Y   -0.886240
Z   -0.475733
Name: C, dtype: float64

In [ ]:
df.iloc[0:2]

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403

Priting column values by passing index

In [ ]:
df.iloc[:,1]

A   -0.286073
B   -0.319631
C   -1.065603
D    0.561192
E    1.574634
Name: X, dtype: float64

In [ ]:
df.iloc[:,1:3]

          X         Y
A -0.286073 -0.484565
B -0.319631 -0.536629
C -1.065603 -0.886240
D  0.561192 -1.305549
E  1.574634 -0.031075

**Selecting subset of rows and columns**

In [ ]:
df.loc['B','Y']

-0.53662936223473

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  1.749455 -0.484565
B -0.008285 -0.536629

Selecting particular rows and column

In [ ]:
df.iloc[[1,3],[1,2,3]]

          X         Y         Z
B -0.319631 -0.536629  0.315403
D  0.561192 -1.305549 -1.119475

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [ ]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

In [ ]:
df>0

       W      X      Y      Z
A   True  False  False  False
B  False  False  False   True
C   True  False  False  False
D   True   True  False  False
E   True   True  False  False

In [ ]:
df[df>0]

          W         X   Y         Z
A  1.749455       NaN NaN       NaN
B       NaN       NaN NaN  0.315403
C  0.421051       NaN NaN       NaN
D  0.689682  0.561192 NaN       NaN
E  0.736837  1.574634 NaN       NaN

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

In [ ]:
df[df['W']>0]['Y']

A   -0.484565
C   -0.886240
D   -1.305549
E   -0.031075
Name: Y, dtype: float64

In [ ]:
df[df['W']>0][['Y','X']]

          Y         X
A -0.484565 -0.286073
C -0.886240 -1.065603
D -1.305549  0.561192
E -0.031075  1.574634

For two conditions you can use | and & with parenthesis:

In [ ]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
df

          W         X         Y         Z
A  1.749455 -0.286073 -0.484565 -2.653319
B -0.008285 -0.319631 -0.536629  0.315403
C  0.421051 -1.065603 -0.886240 -0.475733
D  0.689682  0.561192 -1.305549 -1.119475
E  0.736837  1.574634 -0.031075 -0.683447

In [ ]:
newind = 'CA NY WY OR CO'.split()

In [ ]:
df['States'] = newind

In [ ]:
df

          W         X         Y         Z States
A  1.749455 -0.286073 -0.484565 -2.653319     CA
B -0.008285 -0.319631 -0.536629  0.315403     NY
C  0.421051 -1.065603 -0.886240 -0.475733     WY
D  0.689682  0.561192 -1.305549 -1.119475     OR
E  0.736837  1.574634 -0.031075 -0.683447     CO

In [ ]:
df.set_index('States')

               W         X         Y         Z
States
CA      1.749455 -0.286073 -0.484565 -2.653319
NY     -0.008285 -0.319631 -0.536629  0.315403
WY      0.421051 -1.065603 -0.886240 -0.475733
OR      0.689682  0.561192 -1.305549 -1.119475
CO      0.736837  1.574634 -0.031075 -0.683447

In [ ]:
df

          W         X         Y         Z States
A  1.749455 -0.286073 -0.484565 -2.653319     CA
B -0.008285 -0.319631 -0.536629  0.315403     NY
C  0.421051 -1.065603 -0.886240 -0.475733     WY
D  0.689682  0.561192 -1.305549 -1.119475     OR
E  0.736837  1.574634 -0.031075 -0.683447     CO

In [ ]:
df.set_index('States',inplace=True)

In [ ]:
df

               W         X         Y         Z
States
CA      1.749455 -0.286073 -0.484565 -2.653319
NY     -0.008285 -0.319631 -0.536629  0.315403
WY      0.421051 -1.065603 -0.886240 -0.475733
OR      0.689682  0.561192 -1.305549 -1.119475
CO      0.736837  1.574634 -0.031075 -0.683447

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [ ]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [ ]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.095630 -0.309577
   2  0.725752  1.549072
   3  0.630080  0.073493
G2 1  0.732271 -0.642575
   2 -0.178093 -0.573955
   3 -0.204375 -0.486495

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [ ]:
df.loc['G1']

          A         B
1  1.095630 -0.309577
2  0.725752  1.549072
3  0.630080  0.073493

In [ ]:
df.loc['G1'].loc[1]

A    1.095630
B   -0.309577
Name: 1, dtype: float64

In [ ]:
df.index.names

FrozenList([None, None])

In [ ]:
df.index.names = ['Group','Num']

In [ ]:
df

                  A         B
Group Num
G1    1    1.095630 -0.309577
      2    0.725752  1.549072
      3    0.630080  0.073493
G2    1    0.732271 -0.642575
      2   -0.178093 -0.573955
      3   -0.204375 -0.486495

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

Keep only the rows with at least 1 non-NA values.

In [ ]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

Rows having atleast 2 non - NA values

In [ ]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [ ]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [ ]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

**Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [ ]:
df.groupby('Company')

You can save this object as a new variable:

In [ ]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [ ]:
by_comp.all()

         Person  Sales
Company
FB         True   True
GOOG       True   True
MSFT       True   True

In [ ]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
  df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [ ]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [ ]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [ ]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [ ]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Merging, Joining, and Concatenating

There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. In this lecture we will discuss these 3 methods with examples.

### Example DataFrames

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [ ]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [ ]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

_____
## Example DataFrames

In [ ]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
    
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [ ]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

Or to show a more complicated example:

In [ ]:
import pandas as pd
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [ ]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [ ]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [ ]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [ ]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [ ]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [ ]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [ ]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [ ]:
df['col2'].unique()

array([444, 555, 666])

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [ ]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [ ]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [ ]:
def times2(x):
    return x*2

In [ ]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df['col1'].sum()

10

**Permanently Removing a Column**

In [ ]:
del df['col1']

In [ ]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [ ]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [ ]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [ ]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Find Null Values or Check for Null Values**

In [ ]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [ ]:
1# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Filling in NaN values with something else: **

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [ ]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [ ]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

Uploading our kaggle json file

In [ ]:
from google.colab import files
my_file=files.upload()

Saving kaggle.json to kaggle.json

Setting up our kaggle credentials

In [ ]:
import os
import pandas as pd
cred = pd.read_json("kaggle.json",lines=True)
os.environ['KAGGLE_USERNAME'] = cred.iloc[0][0]
os.environ['KAGGLE_KEY'] = cred.iloc[0][1]

## CSV

### CSV Input

In [ ]:
!kaggle datasets download -d vishnuvarthanrao/windows-store

Downloading windows-store.zip to /content
  0% 0.00/93.1k [00:00<?, ?B/s]
100% 93.1k/93.1k [00:00<00:00, 27.5MB/s]

Unzipping and downloading our data

In [ ]:
!unzip "*.zip"

Archive:  windows-store.zip
  inflating: msft.csv

In [ ]:
df = pd.read_csv('/content/msft.csv')
df

                                                   Name  ...     Price
0                                        Dynamic Reader  ...      Free
1     Chemistry, Organic Chemistry and Biochemistry-...  ...      Free
2                                            BookViewer  ...      Free
3                                    Brick Instructions  ...      Free
4     Introduction to Python Programming by GoLearni...  ...      Free
...                                                 ...  ...       ...
5317                                            JS King  ...   269.00
5318                                        MQTTSniffer  ...    64.00
5319                      Dev Utils - JSON, CSV and XML  ...   269.00
5320                                        Simply Text  ...   219.00
5321                                                NaN  ...       NaN

[5322 rows x 6 columns]

### CSV Output

In [ ]:
df.to_csv('example',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

Downloading dataset krom kaggle

In [ ]:
!kaggle datasets download -d prashdash112/african-ngo-data

Downloading african-ngo-data.zip to /content
  0% 0.00/97.8k [00:00<?, ?B/s]
100% 97.8k/97.8k [00:00<00:00, 29.2MB/s]

In [ ]:
!unzip "*.zip"

Archive:  african-ngo-data.zip
  inflating: Data2 (1).xls

Archive:  windows-store.zip
replace msft.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: n

2 archives were successfully processed.

In [ ]:
pd.read_excel('/content/Data2 (1).xls')

       pid    w3_region  ...                 w2_smk_type                 w3_smk_type
0       23      Tbilisi  ...    Filtered cigarettes only  Unfiltered cigarettes only
1       26      Kutaisi  ...    Filtered cigarettes only    Filtered cigarettes only
2       28      Kutaisi  ...    Filtered cigarettes only    Filtered cigarettes only
3       29         Gori  ...    Filtered cigarettes only                         NaN
4       31         Gori  ...    Filtered cigarettes only    Filtered cigarettes only
...    ...          ...  ...                         ...                         ...
1701  4334      Tbilisi  ...    Filtered cigarettes only    Filtered cigarettes only
1702  4337      Tbilisi  ...    Filtered cigarettes only    Filtered cigarettes only
1703  4343  Akhaltsikhe  ...  Unfiltered cigarettes only                    RYO only
1704  4344  Akhaltsikhe  ...    Filtered cigarettes only                    RYO only
1705  4345  Akhaltsikhe  ...    Filtered cigarettes only    Filtered cigarettes only

[1706 rows x 16 columns]

### Excel Output

In [ ]:
df.to_excel('Excel_Sample.xlsx')

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [ ]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [ ]:
df[0]

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]